// printf 실수 출력

#include<stdio.h>

int main(void)
{
	puts("--------------------------");
	puts(" 실수 출력 ");
	puts("--------------------------");
	printf(" %f, %lf, %.2lf \n", 4.23456, 6.56789, 7.77777);
	puts("--------------------------");
	printf("%%f는 float(4byte) 형태로 출력하라 \n");
	puts("--------------------------");
	printf("실수의 기본 출력은 소수점 이하 6자리 까지 \n");
	puts("--------------------------");
	printf("%%lf는 long float(8byte) 형태로 출력\n");
	puts("--------------------------");
	printf("%%.21f는 소수점 이하 2자리만 출력 \n");
	puts("--------------------------");

	return 0;
}